/**

    4. الـ Callback Functions (الفونكشنز كـ معاملات)

    هادو الفونكشنز كيدوزو كـ معاملات لفونكشن أخرى.
    مثال:

    function processArray(arr, callback) {
    return arr.map(callback);
    }
    const double = (num) => num * 2;
    console.log(processArray([1, 2, 3], double)); // Output: [2, 4, 6]

    تمارين:

 */




//*********************************************************************************************** */

/**
 * كري فانكشن applyToArray لي كتاخد مصفوفة وفانكشن كتطبقها على كل عنصر.
 */










//*********************************************************************************************** */

/**
 *  كري Callback Function باش تضيف كلمة "Hello" لكل عنصر في مصفوفة ديال الأسماء.

 */















//*********************************************************************************************** */

/**
 * 
    استعمل فانكشن كـ Callback باش تصفي الأرقام الزوجية من مصفوفة.

 */