/**
    Currying Functions (الفونكشنز المتسلسلة)

    كتقسم الفونكشن الكبيرة لعدة فونكشنز صغار اللي كترجع وحدة بوحدة.
    مثال:

    function curryFunction(a) {
    return function(b) {
        return function(c) {
        return a + b + c;
        };
    };
    }
    console.log(curryFunction(1)(2)(3)); // Output: 6

فائدة:

    كتحسن إعادة استخدام الكود وتطبيق نفس الفونكشن على معطيات متعددة.
 */




//*********************************************************************************************** */

/**
 * كري Async Function باش تأجل تنفيذ فانكشن لمدة 3 ثواني.
 */










//*********************************************************************************************** */

/**
 *  كري Async Function باش تشوف واش المستخدم عندو صبيب إنترنت ولا لا.
 */















//*********************************************************************************************** */

/**
 * كري Async Function باش تجيب بيانات من API معين.
 */