/**

    . Generator Functions (الفونكشنز المولّدة)

    هاد الفونكشنز كتسمح لنا نوقف التنفيذ ونكملو لاحقًا باستعمال الكلمة yield. كتكتب بـ function*.
    مثال:

    function* generateNumbers() {
    yield 1;
    yield 2;
    yield 3;
    }
    const gen = generateNumbers();
    console.log(gen.next().value); // Output: 1
    console.log(gen.next().value); // Output: 2
    console.log(gen.next().value); // Output: 3

    فائدة:

        كتناسب العمليات اللي كتحتاج تنفيذ متدرج بحال قراءة بيانات أو توليد أرقام عشوائية.

 */




//*********************************************************************************************** */

/**
 * كري IIFE لي كتحسب الفرق بين جوج أرقام.
 */










//*********************************************************************************************** */

/**
 *  
    كري IIFE لي كترجع جملة ترحيب
 */















//*********************************************************************************************** */

/**
 * كري IIFE لي كتحسب العدد الإجمالي ديال عناصر مصفوفة.
 */