/**

    Higher-Order Functions (الفونكشنز العليا)

    هي الفونكشنز اللي كتقبل فونكشن أخرى كـ معامل أو كترجع فونكشن جديدة.
    مثال:

    function higherOrderFunction(callback) {
    return callback(5);
    }
    const multiplyByTwo = (num) => num * 2;
    console.log(higherOrderFunction(multiplyByTwo)); // Output: 10

    فائدة:

        كتستعمل بزاف فالبرمجة الوظيفية (Functional Programming).

 */




//*********************************************************************************************** */

/**
 * كري Async Function باش تأجل تنفيذ فانكشن لمدة 3 ثواني.
 */










//*********************************************************************************************** */

/**
 *  كري Async Function باش تشوف واش المستخدم عندو صبيب إنترنت ولا لا.
 */















//*********************************************************************************************** */

/**
 * كري Async Function باش تجيب بيانات من API معين.
 */