/**

    
    6. IIFE (Immediately Invoked Function Expressions)

    هادو فونكشنز كيتنفدو مباشرة من بعد ما تكتبوهم.
    مثال:

    (function () {
    console.log("This function runs immediately!");
    })();

    تمارين:

 */




//*********************************************************************************************** */

/**
 * كري IIFE لي كتحسب الفرق بين جوج أرقام.
 */










//*********************************************************************************************** */

/**
 *  
    كري IIFE لي كترجع جملة ترحيب
 */















//*********************************************************************************************** */

/**
 * كري IIFE لي كتحسب العدد الإجمالي ديال عناصر مصفوفة.
 */