/**

    Methods (الميثودات داخل الكلاسات أو الكائنات)

    هي فونكشنز مرتبطة بالكائن (object) أو بالكلاس.
    مثال:

    const person = {
    name: "Amine",
    greet() {
        return `Hello, ${this.name}!`;
    },
    };
    console.log(person.greet()); // Output: Hello, Amine!

    فائدة:

        كتخدم بزاف فـ OOP (البرمجة الكائنية).

*/




//*********************************************************************************************** */

/**
 * كري Async Function باش تأجل تنفيذ فانكشن لمدة 3 ثواني.
 */










//*********************************************************************************************** */

/**
 *  كري Async Function باش تشوف واش المستخدم عندو صبيب إنترنت ولا لا.
 */















//*********************************************************************************************** */

/**
 * كري Async Function باش تجيب بيانات من API معين.
 */