/**

     Recursive Functions (الفونكشنز العودية)

    هاد الفونكشن كتعاود تنادي على راسها باش تحل مشكل معين بحال العمليات الحسابية المتكررة.
    مثال:

    function factorial(n) {
    if (n === 0) return 1;
    return n * factorial(n - 1);
    }
    console.log(factorial(5)); // Output: 120

    فائدة:

        مفيدة لحسابات متكررة بحال المضروب (factorial) أو استعراض هيكل شجري (tree structure).
  
 */




//*********************************************************************************************** */

/**
 * كري Async Function باش تأجل تنفيذ فانكشن لمدة 3 ثواني.
 */










//*********************************************************************************************** */

/**
 *  كري Async Function باش تشوف واش المستخدم عندو صبيب إنترنت ولا لا.
 */















//*********************************************************************************************** */

/**
 * كري Async Function باش تجيب بيانات من API معين.
 */