/**
    Static Methods (الميثودات الثابتة)

    هاد النوع كيكون خاص بالكلاسات ومربوط مباشرة بالكلاس مشي بالـ instance.
    مثال:

    class MathUtils {
    static add(a, b) {
        return a + b;
    }
    }
    console.log(MathUtils.add(3, 4)); // Output: 7

    فائدة:

        مفيد لكتابة ميثودات ما كتعتمدش على بيانات الكلاس مباشرة.
 */




//*********************************************************************************************** */

/**
 * كري Async Function باش تأجل تنفيذ فانكشن لمدة 3 ثواني.
 */










//*********************************************************************************************** */

/**
 *  كري Async Function باش تشوف واش المستخدم عندو صبيب إنترنت ولا لا.
 */















//*********************************************************************************************** */

/**
 * كري Async Function باش تجيب بيانات من API معين.
 */